#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.goodnight_notify will be created
  + resource "aws_cloudwatch_log_metric_filter" "goodnight_notify" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/yama-dev-env-goodnight"
      + name           = "yama-dev-env-goodnight-notify"
      + pattern        = "{$.Notify = 'true'}"

      + metric_transformation {
          + name      = "EventCount"
          + namespace = "yama/LogMetric"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.goodnight_notify will be created
  + resource "aws_cloudwatch_metric_alarm" "goodnight_notify" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Ararm for goodnight lambda"
      + alarm_name                            = "yama-dev-env-goodnight-notify"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "yama-dev-env-goodnight-notify"
      + tags                                  = {
          + "Author" = "yamaguti-dxa"
          + "Name"   = "yama-dev-env-goodnight-notify"
        }
      + treat_missing_data                    = "missing"
    }

  # aws_iam_role.lambda_notify_teams will be created
  + resource "aws_iam_role" "lambda_notify_teams" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "yama-dev-env-lambda-notify-teams"
      + path                  = "/"
      + tags                  = {
          + "Author" = "yamaguti-dxa"
          + "Name"   = "yama-dev-env-lambda-notify-teams"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.lambda_notify_teams will be created
  + resource "aws_iam_role_policy" "lambda_notify_teams" {
      + id     = (known after apply)
      + name   = "yama-dev-env-lambda-notify-teams"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "yama-dev-env-lambda-goodnight"
    }

  # aws_lambda_function.goodnight will be updated in-place
  ~ resource "aws_lambda_function" "goodnight" {
        arn                            = "arn:aws:lambda:ap-northeast-1:521635626865:function:yama-dev-env-goodnight"
        filename                       = "lambda/artifacts/goodnight.zip"
        function_name                  = "yama-dev-env-goodnight"
        handler                        = "main.lambda_handler"
        id                             = "yama-dev-env-goodnight"
        invoke_arn                     = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:521635626865:function:yama-dev-env-goodnight/invocations"
      ~ last_modified                  = "2020-05-01T06:47:10.912+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:ap-northeast-1:521635626865:function:yama-dev-env-goodnight:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::521635626865:role/yama-dev-env-lambda-goodnight"
        runtime                        = "python3.6"
      ~ source_code_hash               = "4aEw8rwFMqEQfJSZJVY4yRlG4QztHBjN3IhRtjpNZ1E=" -> "ZUWZB6zWy78DeRSPb50GEZHGSnSL5g5dggusAe3xJaw="
        source_code_size               = 468
        tags                           = {
            "Author" = "yamaguti-dxa"
            "Name"   = "yama-dev-env-goodnight"
        }
        timeout                        = 30
        version                        = "$LATEST"

        tracing_config {
            mode = "PassThrough"
        }
    }

  # aws_lambda_function.notify_teams will be created
  + resource "aws_lambda_function" "notify_teams" {
      + arn                            = (known after apply)
      + filename                       = "lambda/artifacts/notify_teams.zip"
      + function_name                  = "yama-dev-env-notify-teams"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.6"
      + source_code_hash               = "EAqRKusWaCqzySq/VwtKYtbDKZ3FSu9+/rrhYjqcRz0="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Author" = "yamaguti-dxa"
          + "Name"   = "yama-dev-env-notify-teams"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.sns_notify_teams will be created
  + resource "aws_lambda_permission" "sns_notify_teams" {
      + action        = "lambda:InvokeFunction"
      + function_name = "yama-dev-env-notify-teams"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromSNS"
    }

  # aws_sns_topic.default will be created
  + resource "aws_sns_topic" "default" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "yama-dev-env"
      + policy = (known after apply)
      + tags   = {
          + "Author" = "yamaguti-dxa"
          + "Name"   = "yama-dev-env"
        }
    }

  # aws_sns_topic_subscription.teams will be created
  + resource "aws_sns_topic_subscription" "teams" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 8 to add, 1 to change, 0 to destroy.
```

</details>

*Workflow: `dev-env.terraform.ci-pr`, Action: `hashicorpterraform-github-actions3`, Working Directory: `./dev-env/terraform`, Workspace: `default`*
